pandas - **pan**el **da**ta

## Creating Pandas Dataframes

Pandas Dataframes are widely used to store data. Its like a 2-dim array. Works well with `numpy`.

Firstly, pandas must be imported.

Then a new, empty dataframe can be created with `Dataframe()`.

In [1]:
import pandas as pd

df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

We can also create a new dataframe with column names only.

In [2]:
pd.DataFrame(columns=['x','y'])

Empty DataFrame
Columns: [x, y]
Index: []

## Filling the dataframe

We can pass a dictionary.

Note: if the dictionary contains values, these must be in an array! Even for single values (e.g. `[25]` )!

In [3]:
#Dictionary with 2 columns and multiple entries:
dic = {'name': ['luc', 'miri', 'benz'], 'age': [25, 24, 14] }

#Fill dict into dataframe:
df = pd.DataFrame(dic)

print(df)

name  age
0   luc   25
1  miri   24
2  benz   14

## Accessing the dataframe

1. We can view the first top entries with `head()` or the bottom entries with `tail()`.

In [4]:
#Show the top 2 rows:
df.head(2)

   name  age
0   luc   25
1  miri   24

In [5]:
#Show the bottom 2 rows:
df.tail(2)

   name  age
1  miri   24
2  benz   14

2. We can view any column by passing the name of the column.

In [6]:
#Show the column 'age':
df['age']

0    25
1    24
2    14
Name: age, dtype: int64

3. We can randomly sample a number of dataframe entries, by using `sample()`

In [7]:
df.sample(2)

   name  age
0   luc   25
2  benz   14

4. We can extract a row by its index, if we use ` iloc[index]` (indexlocation)

In [42]:
#output row at index=2:
df.iloc[2]

name        benz
age           14
Solinger    True
Name: 2, dtype: object

5. We can loop through the rows of a dataframe using `iterrows()`

In [43]:
for index, row in df.iterrows():
    print(index)
    print(row)

0
name         luc
age           25
Solinger    True
Name: 0, dtype: object
1
name         miri
age            24
Solinger    False
Name: 1, dtype: object
2
name        benz
age           14
Solinger    True
Name: 2, dtype: object
3
name        freddy
age             30
Solinger     False
Name: 3, dtype: object

## Turning dataframe into numpy

We can turn a dataframe (or just a column) into a numpy array by using `to_numpy()`.

(Alternative: `values` would work too)

In [9]:
#One (preferred) way of doing it:
print(df.to_numpy())

#Turning only column to numpy array:
print(df['age'].to_numpy())

#Alternative:
print(df['age'].values)

[['luc' 25]
 ['miri' 24]
 ['benz' 14]]
[25 24 14]
[25 24 14]

We can also turn a column (or multiple columns) into separate dataframes by using the `[[ ]]` notation.

In [10]:
#This df1 is a new dataframe that consists of the df-columns 'age' and 'name':
df1 = df[['age', 'name']]
df1

   age  name
0   25   luc
1   24  miri
2   14  benz

## Adding a row

If we want to add a new row, we must turn it into a dataframe first, then we can `append` them.

Set `ignore_index = True` to keep an ascending index order of the enlarged dataframe.

Set `ignore_index = False` to keep the index order of the appended dataframe within the enlarged dataframe.

In [11]:
#The new row must be a dataframe first:
#Note, that when turning a dict into a dataframe, all values (even single values), must be in an array!
one_new_row = pd.DataFrame({'name': 'freddy', 'age': [30]})
print(one_new_row)

#Now, using append, this dataframe can be glued to the bottom of the dataframe df, wobei die Indexfolge von df übernommen wird:
df = df.append(one_new_row, ignore_index=True)
df

name  age
0  freddy   30

     name  age
0     luc   25
1    miri   24
2    benz   14
3  freddy   30

## Adding a column

We can simply add a column to a dataframe by calling the dataframe with the new column name and assigning it the values.

If this column already exists, it will be overwritten with the given values.

In [12]:
df['Solinger'] = [True, False, True, False]
df

     name  age  Solinger
0     luc   25      True
1    miri   24     False
2    benz   14      True
3  freddy   30     False

## Turning Dataframe into SQLite Database

Conversely, we can turn a pandas dataframe back into a SQLite database table by using `to_sql()`.

First, we need to specify which database. We create a connection to the database file. It will be created, if no database exists.

`to_sql()` will write the dataframe into a new table with name `family_locations`. If this table exists, it will be replaced. The indizes of the dataframe will not get a separate column, when setting `index = False`.

In [13]:
import sqlite3

#Specify database location; create if doesn't exist:
con = sqlite3.connect("example.db")

#Turn dataframe into a new table in the database; replace if it already exists; don't mind putting the indizes into it too:
df.to_sql('family_locations', con, if_exists='replace', index=False)

#write into database:
con.commit()

# close connection:
con.close()

## Turning SQLite Database into Dataframe

We can turn a SQLite database into a pandas dataframe by using `read_sql_query()` and passing the cursor.

In [14]:
#connect to SQlite database:
con = sqlite3.connect("example.db")

#turn everything from the database into a dataframe:
family_df = pd.read_sql_query("select * from family_locations;", con)

#close connection:
con.close()

family_df

     name  age  Solinger
0     luc   25         1
1    miri   24         0
2    benz   14         1
3  freddy   30         0

## Turning Dataframe into other files

`to_x()` fill turn the dataframe into many more files.

In [15]:
#Turn dataframe into a json file:
df.to_json('example.json')

#Turn dataframe into a csv file:
df.to_csv('example.csv')

## Droping or filling in `NaN`-values

Sometimes the dataframe holds `NaN`-values, to mark that there is no value given. This is often found in real world data sets.

In [16]:
import numpy as np

#Given a dataframe with NaN-values:
data1 = pd.DataFrame({'id': ['observ_1', 'observ_2', 'observ_3', 'observ_4', 'observ_5'], 'val1': [42.3, np.nan, np.nan, 12.3, 82.2]})
data1

         id  val1
0  observ_1  42.3
1  observ_2   NaN
2  observ_3   NaN
3  observ_4  12.3
4  observ_5  82.2

These row objects with `NaN`-values are not of importance and can be dropped with `dropna()`

In [17]:
#Drop all row objects with NaN-values:
data1.dropna()

         id  val1
0  observ_1  42.3
3  observ_4  12.3
4  observ_5  82.2

Or we can fill the `NaN`-values with a 0 by using `fill.na(value=0)`

In [18]:
data1.fillna(value=0)

         id  val1
0  observ_1  42.3
1  observ_2   0.0
2  observ_3   0.0
3  observ_4  12.3
4  observ_5  82.2

In cases such as time series, we can also fill in the `NaN`-values with the value immediately after (`fill.na(method='bfill')` for *backwardfill*) or with the value immediately before (`fill.na(method='ffill')` for *forwardfill*) 

If there are multiple `NaN`-values behind eachother, then the last non-`NaN`-value or the first non-`NaN`-value respectively will be used.

In [19]:
data1.fillna(method='ffill')

         id  val1
0  observ_1  42.3
1  observ_2  42.3
2  observ_3  42.3
3  observ_4  12.3
4  observ_5  82.2

In [20]:
data1.fillna(method='bfill')

         id  val1
0  observ_1  42.3
1  observ_2  12.3
2  observ_3  12.3
3  observ_4  12.3
4  observ_5  82.2

## Merging two dataframes

By using `dataframe1.merge(dataframe2)`, we can glue dataframe 2 on the right side of dataframe1. It will automatically look for a common column to merge upon, the different columns of dataframe2 (to dataframe1) will be glued on the right side.

In [21]:
df

     name  age  Solinger
0     luc   25      True
1    miri   24     False
2    benz   14      True
3  freddy   30     False

In [22]:
df2 = pd.DataFrame({'name': ['luc', 'miri', 'benz', 'freddy'], 'age': [25,24,14,30], 'height':[180,170,165,177]})
df2

     name  age  height
0     luc   25     180
1    miri   24     170
2    benz   14     165
3  freddy   30     177

In [23]:
#Take df and merge all different columns in df2 on the right:
df.merge(df2)

     name  age  Solinger  height
0     luc   25      True     180
1    miri   24     False     170
2    benz   14      True     165
3  freddy   30     False     177

In [24]:
#Take df2 and merge all different columns in df on the right:
df2.merge(df)

     name  age  height  Solinger
0     luc   25     180      True
1    miri   24     170     False
2    benz   14     165      True
3  freddy   30     177     False

If there are no columns in the two dataframes with the same name, then we can identify with `left_on=` and `right_on=` that dataframe1 comes left and whole of dataframe2 comes right.

In [25]:
df3 = pd.DataFrame({'peoples': ['luc','miri','benz','freddy'], 'sex': ['m','w','m','m']})
df3

  peoples sex
0     luc   m
1    miri   w
2    benz   m
3  freddy   m

In [26]:
df.merge(df3, left_on='name', right_on='peoples')

     name  age  Solinger peoples sex
0     luc   25      True     luc   m
1    miri   24     False    miri   w
2    benz   14      True    benz   m
3  freddy   30     False  freddy   m

If the merging columns differ, then only the rows are merged in which the merging column entries are the same.

In [27]:
df4 = pd.DataFrame({'peoples': ['miri','benz','joy'], 'sex': ['w','m','w']})
df4

  peoples sex
0    miri   w
1    benz   m
2     joy   w

In [28]:
df.merge(df4, left_on='name', right_on='peoples')

   name  age  Solinger peoples sex
0  miri   24     False    miri   w
1  benz   14      True    benz   m

If we want to keep all rows in the merge, then the non-matching complement is filled with `NaN`-values. 

The `NaN`-values can be substituted (s.o.)

We can do this by using an outer join (`how='outer'`)

In [29]:
df5 = df.merge(df4, how='outer', left_on='name', right_on='peoples')
df5

     name   age Solinger peoples  sex
0     luc  25.0     True     NaN  NaN
1    miri  24.0    False    miri    w
2    benz  14.0     True    benz    m
3  freddy  30.0    False     NaN  NaN
4     NaN   NaN      NaN     joy    w

Missing values in column `name` can be taken from column `peoples`. Then column `peoples` can be dropped.

We can use the `apply()` function to run a `lambda`-expression on a column or a row (`axis=0`: column-wise)(`axis=1`: row-wise).

This `lambda`-expression gives a new column.

1. It rewrittes the `NaN`s in df5 into `NA` - this makes it a string, so we can compare it (because `NaN` is not a string, its a float).

2. Then we apply a lambda function to each row (`axes=1`)

3. The function takes a row as input

4. For each input row, it returns the name of the column `peoples`, if the name of the column `name` is `NA`. Otherwise it just takes the name in column `name`.

In [30]:
df5.fillna('NA').apply(lambda row: row['peoples'] if row['name']=='NA' else row['name'], axis=1)

0       luc
1      miri
2      benz
3    freddy
4       joy
dtype: object

Now we can put this column as a new column into the dataframe.

In [31]:
df5['name'] = df5.fillna('NA').apply(lambda row: row['peoples'] if row['name']=='NA' else row['name'], axis=1)
df5

     name   age Solinger peoples  sex
0     luc  25.0     True     NaN  NaN
1    miri  24.0    False    miri    w
2    benz  14.0     True    benz    m
3  freddy  30.0    False     NaN  NaN
4     joy   NaN      NaN     joy    w

We can now drop the other column with `drop()`.

`axis=1` means: we are dropping every row of column name `peoples`.

In [32]:
df5 = df5.drop(['peoples'], axis=1)
df5

     name   age Solinger  sex
0     luc  25.0     True  NaN
1    miri  24.0    False    w
2    benz  14.0     True    m
3  freddy  30.0    False  NaN
4     joy   NaN      NaN    w

## Applying Queries / Receiving subsets

We can also return just a subset of the dataframe by passing a `query()`, which specifies a certain condition that needs to hold.

In [33]:
df5.query('age >= 30 or age == 25')

     name   age Solinger  sex
0     luc  25.0     True  NaN
3  freddy  30.0    False  NaN

We can also receive a random sample of the dataframe by using `sample(n=)`.

If we set `replace=True`, then we allow to randomly sample an instance multiple times.

In [34]:
df5.sample(n=3, replace=True)

   name   age Solinger sex
4   joy   NaN      NaN   w
2  benz  14.0     True   m
1  miri  24.0    False   w

## Mean, Variance and Max/Min

We can perform basic statistical analysis on dataframes.

1. `mean()` gives the mean for each row (`axis=1`, i.e. row-wise) or for each column (`axis=0`, i.e. column-wise)

Note: Only *real* values in a row will be accounted for in `axis=1`, all other values are skipped. 

And when a column is *real*, will it be accounted for in `axis=0`, all other columns are skipped.

In [35]:
print(df5)

print('\n')

print(df5.mean(axis=1))

print('\n')

print(df5.mean(axis=0))

name   age Solinger  sex
0     luc  25.0     True  NaN
1    miri  24.0    False    w
2    benz  14.0     True    m
3  freddy  30.0    False  NaN
4     joy   NaN      NaN    w


0    25.0
1    24.0
2    14.0
3    30.0
4     NaN
dtype: float64


age    23.25
dtype: float64

2. `var()` gives the variance for each row (`axis=1`) or for each column (`axis=0`)

In [36]:
print(df5.var(axis=1))

print('\n')

print(df5.var(axis=0))

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
dtype: float64


age    44.916667
dtype: float64

3. `max()` gives the maximum value for each axis.

Note: Taking `max()` of strings will return the lexicografically maximum value. I.e. the max string will consist of letters each coming in the alphabet *after* the corresponding letter of the other strings. It doesn't matter if the strings are of different sizes, the minimal size counts. Even numeric values in the strings will be lexicografically ordered. When comparing numbers against letters, depending on the python interpreter, a certain character encoding (ASCII, UTF8, Unicode etc.) will be used, that 'orders' these characters in order to make it possible to find a max.

The `min()` string will consist of letters each coming in the alphabet *before* the corresponding letter of the other strings.

In [37]:
print(df5.max(axis=1))

print('\n')

print(df5.max(axis=0))

print('\n')

print(df5.min(axis=0))

0    25.0
1    24.0
2    14.0
3    30.0
4     NaN
dtype: float64


name        miri
age           30
Solinger    True
dtype: object


name         benz
age            14
Solinger    False
dtype: object

In [38]:
import pandas
test_df = pandas.DataFrame({'names': ['2ab', '']})
test_df.max()

names    2ab
dtype: object

## Apply function to each element

Using `applymap()`, we can apply a function to each element of a whole dataframe.

This can be helpful when scaling or transforming the data, e.g. normalization.

Note: `df5['height'].applymap(lambda x: x-2)` would reduce each element in column height by 2, but this is a column, not a whole dataframe, error! 

Instead, `apply()` will work: `df5['height'].apply(lambda x: x-2)`

`df5[['height']].applymap(lambda x: x-2)` would work too, since its a new separate dataframe!

In [39]:
df5['age'].apply(lambda x: x-2)

0    23.0
1    22.0
2    12.0
3    28.0
4     NaN
Name: age, dtype: float64

`copy()` will make an exact duplicate of the dataframe

In [40]:
df5_dupl = df5.copy()
df5_dupl.head()

     name   age Solinger  sex
0     luc  25.0     True  NaN
1    miri  24.0    False    w
2    benz  14.0     True    m
3  freddy  30.0    False  NaN
4     joy   NaN      NaN    w